Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(1, None, None, Non 0                                            
__________________________________________________________________________________________________
dense (Dense)                   (1, None, None, None 6400        input_1[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (1, None, None, None 4160        dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (1, None, None, None 4160        dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (1, None, None, None 4160        dense_2[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (1, None, None, None 4160        dense_3[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (1, None, None, None 0           dense_4[0][0]                    
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (1, None, None, None 10496       concatenate[0][0]                
__________________________________________________________________________________________________
dense_6 (Dense)                 (1, None, None, None 4160        dense_5[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (1, None, None, None 4160        dense_6[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (1, None, None, None 4160        dense_7[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(1, None, None, Non 0                                            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (1, None, None, None 0           dense_9[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (1, None, None, None 5248        concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_11 (Dense)                (1, None, None, None 99          dense_10[0][0]                   
__________________________________________________________________________________________________
dense_8 (Dense)                 (1, None, None, None 65          dense_7[0][0]                    
==================================================================================================
Total params: 51,428
Trainable params: 51,428
Non-trainable params: 0
__________________________________________________________________________________________________
