Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 100000, 99)] 0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 100000, 64)   6400        input_1[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 100000, 64)   4160        dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 100000, 64)   4160        dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 100000, 64)   4160        dense_2[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 100000, 64)   4160        dense_3[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 100000, 163)  0           dense_4[0][0]                    
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 100000, 64)   10496       concatenate[0][0]                
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 100000, 64)   4160        dense_5[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 100000, 64)   4160        dense_6[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 100000, 4)    260         dense_7[0][0]                    
==================================================================================================
Total params: 42,116
Trainable params: 42,116
Non-trainable params: 0
__________________________________________________________________________________________________
